In [146]:
import pandas as pd
import numpy as np

In [147]:
data = [1,2,3]

In [148]:
data = np.array(data)

In [149]:
type(data)

numpy.ndarray

In [150]:
data = [1,2,3]

In [151]:
pd_data = pd.Series(data)

In [152]:
type(pd_data)

pandas.core.series.Series

In [153]:
pd_data

0    1
1    2
2    3
dtype: int64

In [154]:
dlc = {'a':1,'b':1,'c':2}

In [155]:
a = pd.Series(dlc)

In [156]:
a = pd.Series([0,1,2],index = ['a','1','2'])

In [157]:
a

a    0
1    1
2    2
dtype: int64

In [158]:
a['1'] = 1

In [159]:
a[['a','2']]

a    0
2    2
dtype: int64

In [160]:
a[[0,2]]

a    0
2    2
dtype: int64

In [161]:
a[0]

0

In [162]:
a.index

Index(['a', '1', '2'], dtype='object')

In [163]:
a.shape     #크기

(3,)

In [164]:
a.dtype

dtype('int64')

In [165]:
a = pd.Series([0,1,2])

In [166]:
b = pd.Series([2,3,4])

In [167]:
a.T @ b    #벡터 매트릭스 연산

11

In [168]:
a = pd.Series([0,1,2],index = ['a','b','c'])

In [169]:
b = pd.Series([2,3,4])

In [170]:
a + b

a   NaN
b   NaN
c   NaN
0   NaN
1   NaN
2   NaN
dtype: float64

In [175]:
a.T @ b     # index가 일치하지 않기 때문에 오류 발생

ValueError: matrices are not aligned

In [176]:
dlc = {"이름":['김수안','김수정','박동윤','강이안','강지안'],
      "나이":[19,23,22,19,16],
      "성별":['여','여','남','여','남'],
      "평점":[4.35,4.23,4.45,4.37,4.25]}

In [177]:
data = pd.DataFrame(dlc)

In [178]:
type(data)

pandas.core.frame.DataFrame

In [179]:
data

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [180]:
data.size

20

In [181]:
data.dtypes

이름     object
나이      int64
성별     object
평점    float64
dtype: object

In [182]:
data_list = [['김수안',19,'여',4.35],['김수정',23,'여',4.23],['박동윤',22,'남',4.45]]

In [183]:
pd.DataFrame(data_list)

     0   1  2     3
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45

In [184]:
pd.DataFrame(data_list, index = ['a','b','c'])

     0   1  2     3
a  김수안  19  여  4.35
b  김수정  23  여  4.23
c  박동윤  22  남  4.45

In [185]:
data_list = pd.DataFrame(data_list, index = ['a','b','c'], columns = ['이름', '나이', '성별', '평점'])
data

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45
3  강이안  19  여  4.37
4  강지안  16  남  4.25

In [186]:
data_list.index

Index(['a', 'b', 'c'], dtype='object')

In [187]:
data_list.columns

Index(['이름', '나이', '성별', '평점'], dtype='object')

In [188]:
data_list.columns = ['name','age','sex','grade']

In [189]:
data_list

  name  age sex  grade
a  김수안   19   여   4.35
b  김수정   23   여   4.23
c  박동윤   22   남   4.45

In [190]:
data_list['sex'][0]

'여'

In [191]:
data_list[['sex','name']]

  sex name
a   여  김수안
b   여  김수정
c   남  박동윤

In [192]:
data_list[0:2]

  name  age sex  grade
a  김수안   19   여   4.35
b  김수정   23   여   4.23

In [193]:
data_list[1:3]

  name  age sex  grade
b  김수정   23   여   4.23
c  박동윤   22   남   4.45

In [194]:
data[['이름','나이']]

    이름  나이
0  김수안  19
1  김수정  23
2  박동윤  22
3  강이안  19
4  강지안  16

In [195]:
data[0:3]

    이름  나이 성별    평점
0  김수안  19  여  4.35
1  김수정  23  여  4.23
2  박동윤  22  남  4.45

In [196]:
data.loc[0:3,['이름','나이']]

    이름  나이
0  김수안  19
1  김수정  23
2  박동윤  22
3  강이안  19

In [197]:
data.loc[[0,1,2],['이름','나이']]

    이름  나이
0  김수안  19
1  김수정  23
2  박동윤  22

In [198]:
data.iloc[:4,:2]

    이름  나이
0  김수안  19
1  김수정  23
2  박동윤  22
3  강이안  19

In [199]:
data.index = ['a','b','c','d','e']

In [200]:
data.loc[['a','c','e'],['이름','나이']]

    이름  나이
a  김수안  19
c  박동윤  22
e  강지안  16

In [201]:
data.iloc[[0,2,4],[0,1]]

    이름  나이
a  김수안  19
c  박동윤  22
e  강지안  16

In [202]:
data

    이름  나이 성별    평점
a  김수안  19  여  4.35
b  김수정  23  여  4.23
c  박동윤  22  남  4.45
d  강이안  19  여  4.37
e  강지안  16  남  4.25

In [203]:
data.drop(['a','c'])

    이름  나이 성별    평점
b  김수정  23  여  4.23
d  강이안  19  여  4.37
e  강지안  16  남  4.25

In [204]:
data.drop(['a','c'],axis=0)

    이름  나이 성별    평점
b  김수정  23  여  4.23
d  강이안  19  여  4.37
e  강지안  16  남  4.25

In [206]:
data.drop(['성별'], axis = 1)

    이름  나이    평점
a  김수안  19  4.35
b  김수정  23  4.23
c  박동윤  22  4.45
d  강이안  19  4.37
e  강지안  16  4.25

In [208]:
data     #실제 data에서 성별이 삭제되지는 않음

    이름  나이 성별    평점
a  김수안  19  여  4.35
b  김수정  23  여  4.23
c  박동윤  22  남  4.45
d  강이안  19  여  4.37
e  강지안  16  남  4.25

In [209]:
data.drop(['성별'],axis = 1, inplace = True)

In [211]:
data    #실제 data에서 성별이 삭제되도록 저장됨\

    이름  나이    평점
a  김수안  19  4.35
b  김수정  23  4.23
c  박동윤  22  4.45
d  강이안  19  4.37
e  강지안  16  4.25

In [212]:
data['연락처'] = [None,None,None,None,None]

In [213]:
data.isna()

      이름     나이     평점   연락처
a  False  False  False  True
b  False  False  False  True
c  False  False  False  True
d  False  False  False  True
e  False  False  False  True

In [214]:
data.isnull()

      이름     나이     평점   연락처
a  False  False  False  True
b  False  False  False  True
c  False  False  False  True
d  False  False  False  True
e  False  False  False  True